# Rebar Get Moved Bar Transform Method

Source: https://www.revitapidocs.com/2026/8db286b5-f16e-2367-7e1f-de58fe5a84b8.htm

---

| Rebar Get Moved Bar Transform Method |
| --- |

Returns a transform representing the movement of the bar relative to its default position along the distribution path.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Transform GetMovedBarTransform(
	int barPositionIndex
)
```

```
Public Function GetMovedBarTransform (
	barPositionIndex As Integer
) As Transform
```

```
public:
Transform^ GetMovedBarTransform(
	int barPositionIndex
)
```

```
member GetMovedBarTransform :
        barPositionIndex : int -> Transform
```

#### Parameters

barPositionIndex Int32
:   The bar index.

#### Return Value

Transform
The transform representing the movement of the bar relative to its default position along the distribution path. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex should be in range \[ 0, NumberOfBarPositions\-1 ] and the bar at barPositionIndex should be included. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace